<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"f831ee001c31867d81002be2cff1eb9e917820072c2ed28f099a2f08e7d428ad","plan_job_ref":"Job Pull Request Checks #4523 at https://github.com/GSA-TTS/FAC/actions/runs/14193279600","plan_out_hash":"d958425cf603618ab80e6230ca7d5e722d9f2e1db18fe61d97acee481eac409c","plan_hash":"134bed3056fd096c953e3b208e485ed2c887091c9f3495e2e9f89b62f2432c5f","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 2 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.domain.cloudfoundry_route.origin_route_connected[0] will be created
+   resource "cloudfoundry_route" "origin_route_connected" {
+       created_at   = (known after apply)
+       destinations = [
+           {
+               app_id           = "************************************"
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
+       domain       = "559e0623-9057-45ef-a9ca-e183df56b4e3"
+       host         = "app"
+       id           = (known after apply)
+       protocol     = (known after apply)
+       space        = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
+       updated_at   = (known after apply)
+       url          = (known after apply)
    }

  # module.domain.cloudfoundry_service_instance.external_domain_instance will be updated in-place
!~  resource "cloudfoundry_service_instance" "external_domain_instance" {
+       dashboard_url     = (known after apply)
        id                = "c36480a2-ec78-4e75-b175-d6b53abf2400"
!~      last_operation    = {
!~          created_at  = "2025-03-14T15:51:27Z" -> (known after apply)
+           description = (known after apply)
!~          state       = "succeeded" -> (known after apply)
!~          type        = "update" -> (known after apply)
!~          updated_at  = "2025-03-14T15:51:27Z" -> (known after apply)
        } -> (known after apply)
!~      maintenance_info  = {
+           description = (known after apply)
+           version     = (known after apply)
        } -> (known after apply)
        name              = "gsa-fac-fac.gov"
!~      parameters        = (sensitive value)
        tags              = [
            "terraform-cloudgov-managed",
        ]
!~      updated_at        = "2025-03-14T15:51:27Z" -> (known after apply)
!~      upgrade_available = false -> (known after apply)
#        (4 unchanged attributes hidden)
    }

  # module.production.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-04-02T17:24:18Z" -> (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #4523](https://github.com/GSA-TTS/FAC/actions/runs/14193279600)